//Технологично училише Електронни системи към ТУ София, http://www.elsys-bg.org
//11 А клас
//Номер 12
//Иван Мирославов Манев
/*1. Да се разработи програма, която изисква от потребителя да въведе две целочислени числа, x и y, където x < y. Да се намери сумата на всички нечетни числа в интервала [x,y].
*/

#include <stdio.h> 


int main () {
    
            int x;
            int y;
            int i;
            int a=0;
    
            
    printf("wuwedi x\n");
    scanf("%d", &x);
    printf("wuwedi y\n");
    scanf("%d", &y);
    if (x<y) {
                for (i=x; i<=y; i++)
                          {
                               if (i%2 == 0){   }
                          else {
                               a=a+i;
                               
                               }
                          
                          }
             
             } 
    printf("%d\n", a);
   
   
}

