//Технологично училише Електронни системи към ТУ София, http://www.elsys-bg.org
//11 А клас
//Номер 12
//Иван Мирославов Манев
/* 12. Да се разработи програма, която изисква от потребителя да въведе целочислено число x, където 0<x<10. Да се инициализира масив от 10 елемента. Да се намери първото число N в интервала [0; +∞) делящо се на х. Да се намери сумата на всички числа в интервала [0; N] и да се запише като първи елемент в масива.  Да се намери второто число N' в интервала [0; +∞) делящо се на x. Да се намери сумата на всички числа в интервала [0, N'] и да се запише като втори елемент в масива. Аналогично да се запълнят и останалите елементи на масива. Масивът да се изведе на стандартния изход. */ 


#include <stdio.h> 


main()
{


	int x;
	int n;
	int array[10];
	int i=0;
	int m=0;
	int s=0;	
	int a;

	
	printf("wuwedi chisloto x\n");
	scanf("%d\n", &x);

	if((0<x) && (x<10)) {
				for (n=1; n<10; n++){
				while (i%x == 0) {		
					i=i+1; 
					s=s+i;						
						}
				array[m] = array[m]+s;
				m = m+1;
						     }


				printf("masiwa e : ");
				for (a=0; a<10; a++) {
				printf ("%d\n", array[a]);
				
						}


		     }
						

		

		   
   	else {
		printf("x ne e mejdu 0 i 10");
   
			}




}

