//Технологично училише Електронни системи към ТУ София, http://www.elsys-bg.org
//11 А клас
//Номер 12
//Иван Мирославов Манев
/*14. Да се разработи програма, която изисква от потребителя да въведе целочислено число x, където 0<x<10. Да се инициализира масив от 10 елемента. Да се намери първото просто число в интервала [0; +∞) завършващо на x и да се запише като първи елемент в масива. Да се намери второто просто число в интервала [0;  +∞) завършващо на x и да се запише като втори елемент в масива. Аналогично да се намерят първите N прости числа в интервала [0;  +∞) и да се запишат като елемент N в масива. Масивът да се изведе на стандартния изход.
*/

#include <stdio.h>
#define MAX 10
main(){

	int x;
	int array[MAX];
	int i;
	int a;
	int b;
	int c;

	printf("wuwedi chisloto x\n");
	scanf("%d\n", &x);

	if((0<x) && (x<10)) {
		while (a=MAX-1) {
			for(i=0; i>0; i++) {
				 for(b=2; b <= i - 1; b++) {
                                          if(i%b == 0){
						if (i%x == 0) {
							array[a] = i;

								}
						      }
					}
				}						
 for(c=0; c<MAX; c++){
	printf("%d\n", array[a]);

	
		}
				}
			}
}
