//Технологично училише Електронни системи към ТУ София, http://www.elsys-bg.org
//11 А клас
//Номер 12
//Иван Мирославов Манев
/*2. Да се разработи програма, която изисква от потребителя да въведе две целочислени числа, x и y, където x < y. Да се намери и изведе сумата на числата делящи се на 17 в интервал [x, y].*/

#include <stdio.h> 


int main () {
    
            int x;
            int y;
            int i;
            int a=0;
    
    
    printf("wuwedi x\n");
    scanf("%d", &x);
    printf("wuwedi y\n");
    scanf("%d", &y);
    if (x<y) {
                for (i=x; i<=y; i++)
                          {
                               if (i%17 == 0){
                                          a=a+i; 
                                          
                                          }
                          
                          
                          }
             
             } 
    printf("%d\n", a);
    
}
